turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N0C.atdf
          </instance>
        </module>
        <module name="TC" version="6082ZF">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA4" function="B" group="TCLK" index="0"/>
              <signal pad="PA28" function="B" group="TCLK" index="1"/>
              <signal pad="PA29" function="B" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA15" function="B" group="TIOA" index="1"/>
              <signal pad="PA26" function="B" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA27" function="B" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40014000"/>
            <signals>
              <signal pad="PC25" function="B" group="TCLK" index="3"/>
              <signal pad="PC28" function="B" group="TCLK" index="4"/>
              <signal pad="PC31" function="B" group="TCLK" index="5"/>
              <signal pad="PC23" function="B" group="TIOA" index="3"/>
              <signal pad="PC26" function="B" group="TIOA" index="4"/>
              <signal pad="PC29" function="B" group="TIOA" index="5"/>
              <signal pad="PC24" function="B" group="TIOB" index="3"/>
              <signal pad="PC27" function="B" group="TIOB" index="4"/>
              <signal pad="PC30" function="B" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" version="6212L">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWI" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB5" function="A" group="TWCK" index="1"/>
              <signal pad="PB4" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418E">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PA9" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PB2" function="A" group="URXD" index="1"/>
              <signal pad="PB3" function="A" group="UTXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="USART" version="6089Y">
          <instance name="USART0">
            <register-group address-space="base" name="USART0" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PA8" function="A" group="CTS" index="0"/>
              <signal pad="PA7" function="A" group="RTS" index="0"/>
              <signal pad="PA5" function="A" group="RXD" index="0"/>
              <signal pad="PA2" function="B" group="SCK" index="0"/>
              <signal pad="PA6" function="A" group="TXD" index="0"/>
            </signals>
          </instance>
          <instance name="USART1">
            <register-group address-space="base" name="USART1" name-in-module="USART" offset="0x40028000"/>
            <signals>
              <signal pad="PA25" function="A" group="CTS" index="1"/>
              <signal pad="PA24" function="A" group="RTS" index="1"/>
              <signal pad="PA21" function="A" group="RXD" index="1"/>
              <signal pad="PA23" function="A" group="SCK" index="1"/>
              <signal pad="PA22" function="A" group="TXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" version="6080B">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1450"/>
          </instance>
        </module>
        <module name="FUSES" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
      <module name="SystemControl">
            <instance name="SystemControl">
                <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
            </instance>
        </module><module name="SysTick">
            <instance name="SysTick">
                <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
            </instance>
        </module><module name="NVIC">
            <instance name="NVIC">
                <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
            </instance>
        </module></peripherals>
      <interrupts>
        <interrupt index="-14" name="NonMaskableInt_IRQn" caption="Non Maskable Interrupt"/>
        <interrupt index="-13" name="HardFault_IRQn" caption="HardFault Interrupt"/>
        <interrupt index="-12" name="MemoryManagement_IRQn" caption="Cortex-M3 Memory Management Interrupt"/>
        <interrupt index="-11" name="BusFault_IRQn" caption="Cortex-M3 Bus Fault Interrupt"/>
        <interrupt index="-10" name="UsageFault_IRQn" caption="Cortex-M3 Usage Fault Interrupt"/>
        <interrupt index="-5" name="SVCall_IRQn" caption="Cortex-M3 SV Call Interrupt"/>
        <interrupt index="-4" name="DebugMonitor_IRQn" caption="Cortex-M3 Debug Monitor Interrupt"/>
        <interrupt index="-2" name="PendSV_IRQn" caption="Cortex-M3 Pend SV Interrupt"/>
        <interrupt index="-1" name="SysTick_IRQn" caption="Cortex-M3 System Tick Interrupt"/>
        <interrupt index="0" module-instance="SYSC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="SYSC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="SYSC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="SYSC" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="SYSC" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Flash Controller"/>
        <interrupt index="8" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="9" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="11" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="12" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="13" module-instance="PIOC" name="PIOC" caption="Parallel I/O Controller C"/>
        <interrupt index="14" module-instance="USART0" name="USART0" caption="USART 0"/>
        <interrupt index="15" module-instance="USART1" name="USART1" caption="USART 1"/>
        <interrupt index="19" module-instance="TWI0" name="TWI0" caption="Two Wire Interface 0"/>
        <interrupt index="20" module-instance="TWI1" name="TWI1" caption="Two Wire Interface 1"/>
        <interrupt index="21" module-instance="SPI" name="SPI" caption="Serial Peripheral Interface"/>
        <interrupt index="23" module-instance="TC0" name="TC0" caption="Timer/Counter 0"/>
        <interrupt index="24" module-instance="TC0" name="TC1" caption="Timer/Counter 1"/>
        <interrupt index="25" module-instance="TC0" name="TC2" caption="Timer/Counter 2"/>
        <interrupt index="26" module-instance="TC1" name="TC3" caption="Timer/Counter 3"/>
        <interrupt index="27" module-instance="TC1" name="TC4" caption="Timer/Counter 4"/>
        <interrupt index="28" module-instance="TC1" name="TC5" caption="Timer/Counter 5"/>
        <interrupt index="29" module-instance="ADC" name="ADC" caption="Analog To Digital Converter"/>
        <interrupt index="30" module-instance="DACC" name="DACC" caption="Digital To Analog Converter"/>
        <interrupt index="31" module-instance="PWM" name="PWM" caption="Pulse Width Modulation"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B2E03F"/>
          <property name="CHIPID_CIDR" value="0x29580361"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM3_REV" value="0x0200"/>
        <param name="__MPU_PRESENT" value="0"/>
        <param name="__FPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog-to-Digital Converter" name="ADC" version="6489I">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
