turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N0C.atdf
      <value-group caption="" name="ADC_MR__STARTUP">
        <value caption="0 periods of ADCClock" name="SUT0" value="0x0"/>
        <value caption="8 periods of ADCClock" name="SUT8" value="0x1"/>
        <value caption="16 periods of ADCClock" name="SUT16" value="0x2"/>
        <value caption="24 periods of ADCClock" name="SUT24" value="0x3"/>
        <value caption="64 periods of ADCClock" name="SUT64" value="0x4"/>
        <value caption="80 periods of ADCClock" name="SUT80" value="0x5"/>
        <value caption="96 periods of ADCClock" name="SUT96" value="0x6"/>
        <value caption="112 periods of ADCClock" name="SUT112" value="0x7"/>
        <value caption="512 periods of ADCClock" name="SUT512" value="0x8"/>
        <value caption="576 periods of ADCClock" name="SUT576" value="0x9"/>
        <value caption="640 periods of ADCClock" name="SUT640" value="0xA"/>
        <value caption="704 periods of ADCClock" name="SUT704" value="0xB"/>
        <value caption="768 periods of ADCClock" name="SUT768" value="0xC"/>
        <value caption="832 periods of ADCClock" name="SUT832" value="0xD"/>
        <value caption="896 periods of ADCClock" name="SUT896" value="0xE"/>
        <value caption="960 periods of ADCClock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="ADC_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" version="6417K">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="" name="CHIPID_CIDR__EPROC">
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8K bytes" name="_8K" value="0x1"/>
        <value caption="16K bytes" name="_16K" value="0x2"/>
        <value caption="32K bytes" name="_32K" value="0x3"/>
        <value caption="64K bytes" name="_64K" value="0x5"/>
        <value caption="128K bytes" name="_128K" value="0x7"/>
        <value caption="256K bytes" name="_256K" value="0x9"/>
        <value caption="512K bytes" name="_512K" value="0xA"/>
        <value caption="1024K bytes" name="_1024K" value="0xC"/>
        <value caption="2048K bytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8K bytes" name="_8K" value="0x1"/>
        <value caption="16K bytes" name="_16K" value="0x2"/>
        <value caption="32K bytes" name="_32K" value="0x3"/>
        <value caption="64K bytes" name="_64K" value="0x5"/>
        <value caption="128K bytes" name="_128K" value="0x7"/>
        <value caption="256K bytes" name="_256K" value="0x9"/>
        <value caption="512K bytes" name="_512K" value="0xA"/>
        <value caption="1024K bytes" name="_1024K" value="0xC"/>
        <value caption="2048K bytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48K bytes" name="_48K" value="0x0"/>
        <value caption="1K bytes" name="_1K" value="0x1"/>
        <value caption="2K bytes" name="_2K" value="0x2"/>
        <value caption="6K bytes" name="_6K" value="0x3"/>
        <value caption="24K bytes" name="_24K" value="0x4"/>
        <value caption="4K bytes" name="_4K" value="0x5"/>
        <value caption="80K bytes" name="_80K" value="0x6"/>
        <value caption="160K bytes" name="_160K" value="0x7"/>
        <value caption="8K bytes" name="_8K" value="0x8"/>
        <value caption="16K bytes" name="_16K" value="0x9"/>
        <value caption="32K bytes" name="_32K" value="0xA"/>
        <value caption="64K bytes" name="_64K" value="0xB"/>
        <value caption="128K bytes" name="_128K" value="0xC"/>
        <value caption="256K bytes" name="_256K" value="0xD"/>
        <value caption="96K bytes" name="_96K" value="0xE"/>
        <value caption="512K bytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="AT91SAM9xx Series" name="AT91SAM9xx" value="0x19"/>
        <value caption="AT91SAM9XExx Series" name="AT91SAM9XExx" value="0x29"/>
        <value caption="AT91x34 Series" name="AT91x34" value="0x34"/>
        <value caption="CAP7 Series" name="CAP7" value="0x37"/>
        <value caption="CAP9 Series" name="CAP9" value="0x39"/>
        <value caption="CAP11 Series" name="CAP11" value="0x3B"/>
        <value caption="AT91x40 Series" name="AT91x40" value="0x40"/>
        <value caption="AT91x42 Series" name="AT91x42" value="0x42"/>
        <value caption="AT91x55 Series" name="AT91x55" value="0x55"/>
        <value caption="AT91SAM7Axx Series" name="AT91SAM7Axx" value="0x60"/>
        <value caption="AT91SAM7AQxx Series" name="AT91SAM7AQxx" value="0x61"/>
        <value caption="AT91x63 Series" name="AT91x63" value="0x63"/>
        <value caption="AT91SAM7Sxx Series" name="AT91SAM7Sxx" value="0x70"/>
        <value caption="AT91SAM7XCxx Series" name="AT91SAM7XCxx" value="0x71"/>
        <value caption="AT91SAM7SExx Series" name="AT91SAM7SExx" value="0x72"/>
        <value caption="AT91SAM7Lxx Series" name="AT91SAM7Lxx" value="0x73"/>
        <value caption="AT91SAM7Xxx Series" name="AT91SAM7Xxx" value="0x75"/>
        <value caption="AT91SAM7SLxx Series" name="AT91SAM7SLxx" value="0x76"/>
        <value caption="SAM3UxC Series (100-pin version)" name="SAM3UxC" value="0x80"/>
        <value caption="SAM3UxE Series (144-pin version)" name="SAM3UxE" value="0x81"/>
        <value caption="SAM3AxC Series (100-pin version)" name="SAM3AxC" value="0x83"/>
        <value caption="SAM4AxC Series (100-pin version)" name="SAM4AxC" value="0x83"/>
        <value caption="SAM3XxC Series (100-pin version)" name="SAM3XxC" value="0x84"/>
        <value caption="SAM4XxC Series (100-pin version)" name="SAM4XxC" value="0x84"/>
        <value caption="SAM3XxE Series (144-pin version)" name="SAM3XxE" value="0x85"/>
        <value caption="SAM4XxE Series (144-pin version)" name="SAM4XxE" value="0x85"/>
        <value caption="SAM3XxG Series (208/217-pin version)" name="SAM3XxG" value="0x86"/>
        <value caption="SAM4XxG Series (208/217-pin version)" name="SAM4XxG" value="0x86"/>
        <value caption="SAM3SxASeries (48-pin version)" name="SAM3SxA" value="0x88"/>
        <value caption="SAM4SxA Series (48-pin version)" name="SAM4SxA" value="0x88"/>
        <value caption="SAM3SxB Series (64-pin version)" name="SAM3SxB" value="0x89"/>
        <value caption="SAM4SxB Series (64-pin version)" name="SAM4SxB" value="0x89"/>
        <value caption="SAM3SxC Series (100-pin version)" name="SAM3SxC" value="0x8A"/>
        <value caption="SAM4SxC Series (100-pin version)" name="SAM4SxC" value="0x8A"/>
        <value caption="AT91x92 Series" name="AT91x92" value="0x92"/>
        <value caption="SAM3NxA Series (48-pin version)" name="SAM3NxA" value="0x93"/>
        <value caption="SAM3NxB Series (64-pin version)" name="SAM3NxB" value="0x94"/>
        <value caption="SAM3NxC Series (100-pin version)" name="SAM3NxC" value="0x95"/>
        <value caption="SAM3SDxB Series (64-pin version)" name="SAM3SDxB" value="0x99"/>
        <value caption="SAM3SDxC Series (100-pin version)" name="SAM3SDxC" value="0x9A"/>
        <value caption="SAM5A" name="SAM5A" value="0xA5"/>
        <value caption="AT75Cxx Series" name="AT75Cxx" value="0xF0"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash MemoryNVPSIZ is ROM size      NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
