turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N0C.atdf
        <register caption="Programmable Clock 0 Register 0" name="PMC_PCK0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 1" name="PMC_PCK1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 2" name="PMC_PCK2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Disable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Main XTAL Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Slow Clock Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Fast Start-up Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Start-up Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Start-up Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Start-up Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Start-up Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Start-up Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Start-up Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Start-up Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Start-up Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Start-up Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Start-up Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Start-up Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Start-up Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Start-up Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Start-up Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Start-up Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Start-up Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="Low Power Mode" mask="0x00100000" name="LPM"/>
        </register>
        <register caption="Fast Start-up Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000400" name="FSTP10"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000800" name="FSTP11"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00001000" name="FSTP12"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00002000" name="FSTP13"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00004000" name="FSTP14"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00008000" name="FSTP15"/>
        </register>
