turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N0C.atdf
                <register offset="0x00000d28" size="4" name="CFSR" initval="0" caption="Configurable Fault Status Registers">
                    <bitfield mask="0x00000001" name="IACCVIOL" values="IACCVIOL" caption="no description available"/>
                    <bitfield mask="0x00000002" name="DACCVIOL" values="DACCVIOL" caption="no description available"/>
                    <bitfield mask="0x00000008" name="MUNSTKERR" values="MUNSTKERR" caption="no description available"/>
                    <bitfield mask="0x00000010" name="MSTKERR" values="MSTKERR" caption="no description available"/>
                    <bitfield mask="0x00000020" name="MLSPERR" values="MLSPERR" caption="no description available"/>
                    <bitfield mask="0x00000080" name="MMARVALID" values="MMARVALID" caption="no description available"/>
                    <bitfield mask="0x00000100" name="IBUSERR" values="IBUSERR" caption="no description available"/>
                    <bitfield mask="0x00000200" name="PRECISERR" values="PRECISERR" caption="no description available"/>
                    <bitfield mask="0x00000400" name="IMPRECISERR" values="IMPRECISERR" caption="no description available"/>
                    <bitfield mask="0x00000800" name="UNSTKERR" values="UNSTKERR" caption="no description available"/>
                    <bitfield mask="0x00001000" name="STKERR" values="STKERR" caption="no description available"/>
                    <bitfield mask="0x00002000" name="LSPERR" values="LSPERR" caption="no description available"/>
                    <bitfield mask="0x00008000" name="BFARVALID" values="BFARVALID" caption="no description available"/>
                    <bitfield mask="0x00010000" name="UNDEFINSTR" values="UNDEFINSTR" caption="no description available"/>
                    <bitfield mask="0x00020000" name="INVSTATE" values="INVSTATE" caption="no description available"/>
                    <bitfield mask="0x00040000" name="INVPC" values="INVPC" caption="no description available"/>
                    <bitfield mask="0x00080000" name="NOCP" values="NOCP" caption="no description available"/>
                    <bitfield mask="0x01000000" name="UNALIGNED" values="UNALIGNED" caption="no description available"/>
                    <bitfield mask="0x02000000" name="DIVBYZERO" values="DIVBYZERO" caption="no description available"/>
                </register>
                <register offset="0x00000d2c" size="4" name="HFSR" initval="0" caption="HardFault Status register">
                    <bitfield mask="0x00000002" name="VECTTBL" values="VECTTBL" caption="no description available"/>
                    <bitfield mask="0x40000000" name="FORCED" values="FORCED" caption="no description available"/>
                    <bitfield mask="0x80000000" name="DEBUGEVT" caption="no description available"/>
                </register>
                <register offset="0x00000d30" size="4" name="DFSR" initval="0" caption="Debug Fault Status Register">
                    <bitfield mask="0x00000001" name="HALTED" values="HALTED" caption="no description available"/>
                    <bitfield mask="0x00000002" name="BKPT" values="BKPT" caption="no description available"/>
                    <bitfield mask="0x00000004" name="DWTTRAP" values="DWTTRAP" caption="no description available"/>
                    <bitfield mask="0x00000008" name="VCATCH" values="VCATCH" caption="no description available"/>
                    <bitfield mask="0x00000010" name="EXTERNAL" values="EXTERNAL" caption="no description available"/>
                </register>
                <register offset="0x00000d34" size="4" name="MMFAR" initval="0" caption="MemManage Address Register">
                    <bitfield mask="0xffffffff" name="ADDRESS" caption="Address of MemManage fault location"/>
                </register>
                <register offset="0x00000d38" size="4" name="BFAR" initval="0" caption="BusFault Address Register">
                    <bitfield mask="0xffffffff" name="ADDRESS" caption="Address of the BusFault location"/>
                </register>
                <register offset="0x00000d3c" size="4" name="AFSR" initval="0" caption="Auxiliary Fault Status Register">
                    <bitfield mask="0xffffffff" name="AUXFAULT" caption="Latched version of the AUXFAULT inputs"/>
                </register>
            </register-group>
            <value-group name="RETTOBASE">
                <value value="0" name="VALUE_0" caption="there are preempted active exceptions to execute"/>
                <value value="1" name="VALUE_1" caption="there are no active exceptions, or the currently-executing exception is the only active exception"/>
            </value-group>
            <value-group name="ISRPREEMPT">
                <value value="0" name="VALUE_0" caption="Will not service"/>
                <value value="1" name="VALUE_1" caption="Will service a pending exception"/>
            </value-group>
            <value-group name="PENDSTCLR">
                <value value="0" name="VALUE_0" caption="no effect"/>
                <value value="1" name="VALUE_1" caption="removes the pending state from the SysTick exception"/>
            </value-group>
            <value-group name="PENDSTSET">
                <value value="0" name="VALUE_0" caption="write: no effect; read: SysTick exception is not pending"/>
                <value value="1" name="VALUE_1" caption="write: changes SysTick exception state to pending; read: SysTick exception is pending"/>
            </value-group>
            <value-group name="PENDSVCLR">
                <value value="0" name="VALUE_0" caption="no effect"/>
                <value value="1" name="VALUE_1" caption="removes the pending state from the PendSV exception"/>
            </value-group>
            <value-group name="PENDSVSET">
                <value value="0" name="VALUE_0" caption="write: no effect; read: PendSV exception is not pending"/>
                <value value="1" name="VALUE_1" caption="write: changes PendSV exception state to pending; read: PendSV exception is pending"/>
            </value-group>
            <value-group name="NMIPENDSET">
                <value value="0" name="VALUE_0" caption="write: no effect; read: NMI exception is not pending"/>
                <value value="1" name="VALUE_1" caption="write: changes NMI exception state to pending; read: NMI exception is pending"/>
            </value-group>
